module java_Practice {
}
/*
 1주차 연습문제 (금번 문제는 난이도 조절을 위한 부분도 포함되어 있으며, 해결 속도를 기준으로 난이도를 조절할 예정임)
 

1. 선택문(if문)을 사용하여 사용자로부터 입력 받은 두 수 중 큰 수를 화면에 출력하는 프로그램을 작성하세요.

2. 사용자로부터 데이터를 입력 받고, 입력 받은 데이터를 출력하는 프로그램을 작성하세요.

   (단, 입력 받은 데이터가 Q 또는 q 이며, 프로그램 종료하고, 그렇지 않다면 계속 데이터를 입력 받는다.)

3. 사용자로부터 입력 받은 문자의 개수를 출력하고, 문자열을 소문자와 대문자로 변환하여 출력하는 프로그램을 작성하세요.
	1) Scanner 객체를 사용해서 문자열을 입력 받고, 2) 입력 받은 문자열 전체를 대문자로 출력하고, 3) 입력 받은 문자열 전체를 소문자로 출력해 주세요.
예) 입력 받은 문자열이 “ABcd” 이라면, 대문자로 “ABCD”, 소문자로 “abcd”와 같이 2줄 출력
4. 50명의 학생의 점수를 입력하고, 평균을 계산하는 프로그램을 작성하세요.

5. 5명의 학생의 이름을 입력 받아서 알파벳 순으로 정렬하는 프로그램을 작성하세요.
*/